package com.zy.common.core.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

@Getter
@AllArgsConstructor
public enum ErrorCode {
    E000000("000000", "success"),

    // 通用错误码 999xxx：按错误场景使用，不能随意混用
    // 参数校验类：入参为空、格式错误、文件类型不合法、前端传入 ID 查询不到、前端提交唯一值已存在等参数错误
    E999001("999001", "参数错误"),
    // 操作失败类：操作数据库、OSS、RPC、HTTP 等资源失败
    E999002("999002", "操作失败"),
    // 数据异常类：后端内部流程关联查询数据不存在、聚合根不完整等
    E999003("999003", "数据异常"),
    // 限流类：Redis 分布式锁获取失败、限流组件限流等
    E999004("999004", "操作过于频繁，请稍后再试"),
    // 鉴权类：越权访问数据、接口等
    E999005("999005", "非法访问"),
    // 未知异常：不知道什么原因导致、无法归因到明确业务场景的系统异常
    E999999("999999", "系统异常"),

    // 系统用户相关 10xxxx
    E100001("100001", "用户名不存在"),
    E100002("100002", "账号或密码错误"),
    E100003("100003", "用户已禁用"),
    E100004("100004", "OTP验证码错误"),
    E100005("100005", "无权限操作"),

    // 客户相关 20xxxx
    E200001("200001", "客户不存在"),
    E200002("200002", "主体名称重复"),
    E200003("200003", "纳税人识别号重复"),
    E200004("200004", "简称重复"),

    // 项目相关 30xxxx
    E300001("300001", "项目不存在"),
    E300002("300002", "项目商品不存在"),
    E300004("300004", "项目对接人不存在"),

    // 合同相关 40xxxx
    E400001("400001", "合同不存在"),
    E400002("400002", "今日合同编号已用完，请明日再试"),
    E400003("400003", "预算合作方式下合同预算上限必填"),
    E400004("400004", "合作周期结束日期必须晚于开始日期"),
    E400005("400005", "合同附件上传失败"),

    // 券批次相关 50xxxx
    E500001("500001", "微信立减金批次不存在"),
    E500002("500002", "微信立减金批次已存在"),
    E500003("500003", "微信立减金批次已分配"),
    E500004("500004", "微信立减金批次号不能修改"),
    E500005("500005", "微信立减金批次库存不存在"),
    E500006("500006", "固定面额批次预算必须大于等于微信总预算"),
    E500007("500007", "固定面额批次预算必须是面额的整数倍");

    private final String code;
    private final String message;

}
